<H1>PANDAS....</H1>

### QUICK RECAP

# Pandas
# ->Used for tabular data
# ->Used in SQL,EXCEL,.CSV
# ->Types in Pandas:-
#   ->Structured >that is organised in well formed in matrix,2D,RDBMS,
#   ->Unstructured
#   ->Semi-structured
# ->High level api
# ->Two primary keys:- series(1 dimensional) and dataframes(2 dinemional series)
# ->Pandas gives output as dataframe
# ->Two series make a dataframe# ->normally distributed data then we fill mean not normally distributed then we fill median
# ->#loc and iloc location wise uses
    # df.loc[10:20]                           #row filter
    # df.loc[10:20,0:5]                       #columne filter error
    # loc[row_index,column_labels]
# ->#missing value handle
    # 1. remove the records
    # 2.records fill
    # Remove the records
    # not more then 5% or 12% records should by deleted
#   #Fill the records  -> by knowing the domain knowledge
# ->normally distributed data then we fill mean not normally distributed then we fill median
# SOME PROGRAM.....
#    ->type(df) ->pandas.core.frame.DataFrame (For the dataframe)
#    ->type(df["Name"])->pandas.core.series.Series(For the series)
#    ->df=pd.read_csv("Used_Bikes.csv")          (For reading the csv files)
#    ->df.head()                                 #by default it will return top five row
#    ->df.tail()                                 #by default it will return last five row
#    ->df.info()                                 #gives the information 
#    ->df["price"]                               #datatyoe is series
#    ->df[["price"]]                             #data is in dataframe
#    ->df.loc[10:20,["bike_name","price","city","kms_driven"]]
#    ->df.iloc[20:30,3:6]                        #Silacing
#    -> df["price"].min()  ,df["price"].max(),   df["price"].meadian(),   df["price"].var(),   df["price"].std()
#    ->df.shape                                  #gives row and column
#    ->df.dtypes                                 #in numpy there we write dtype and in pandas we write datatypes
#    -># df["bike_price"] <=50000                   #filter the data type 
      # under_50K=df[df["bike_price"] <=50000]
#    ->under_50K["owner"].value_counts()         #value_counts() gives the counts of how much the owner are there in a particular field
#    ->under_50K_first["brand"].nunique()        #Count number of distinct elements in specified axis
#    ->df["brand"].unique()                      #Uniques are returned in order of appearance. This does NOT sort
#    ->categorial=df.select_dtypes(include="O")  #0->object  #all the string value are printed
#    ->numercial=df.select_dtypes(exclude="O")   #all the numerical value are printed
#    ->combined_df=pd.concat([categorial,numercial],axis="columns")   #it combined all the values
#    ->df.drop("bike_name",axis="columns")       #by default it drop a row by as we donot have a row then you have to give axis to column
#    ->df.drop("bike_name",axis="columns",inplace=True) #inplace delete from the data fully but when we print only axis then it will only drop for sometime
#    ->df['fake_price']=df['price']+1000          #add 1000 fake price in price and print and make a new fake price column
#    ->df.duplicated()                            #Return boolean Series denoting duplicate rows
#    ->df.duplicated().sum()                      #count the number of duplicate rows in a DataFrame
#    ->df.drop_duplicates()                       #Return DataFrame with duplicate rows removed
#    ->brand_ls=["KTM","Suzuki","Jawa"]           #Whether each element in the DataFrame is contained in values
        #df[df["brand"].isin(brand_ls)]
#    ->filter_df=df[(df["brand"]=="KTM")|(df["brand"]=="Suzuki")|(df["brand"]=="Jawa")]   #filter the list data through giving diffent brand-
#    ->jaipur.sort_values(by="price")              #ascending order
#    ->jaipur.sort_values(by="price",ascending=False) #when you wanted to print the element in descending order 
#    ->dt = {"A":[1,2,4,np.nan,5],
         #   "B":[7,4,np.nan,9,2],
         #   "C":[np.nan,8,7,5,6],
         #   "D":[7,4,1,2,5]}                     #to write the dictionary in the numpy
#    ->v.to_csv('delhi_top_ten.csv',index=False)  #to make the csv files 
#    -> df.isnull().sum()                         #Detect missing values
#    ->df.dropna(axis="columns")                  #to access in columns deletion
#    ->df.dropna()                                #by default it remove the row
#    -> df["A"].fillna(1000)                      #ny deafault it will print a constant values
#    ->output=df["owner"].map(label)             #apply a function to a Dataframe elementwise.
#    ->bajaj_group= bajaj.groupby("owner")       #agg function is usedto print all the function in one statement
       # bajaj_group["price"].agg(min_prices="min",max_prices="max",mean_prices="mean")
#    ->min_price.reset_index()                   #it is used to reset the index

In [5]:
import pandas as pd

MAKING THE DICTIONARY

In [209]:
dt={"Name":["nikki","pragati","arushi","krtik"],
    "Branch":["cse","IT","ECE","CSE"],
    "class":[1,2,3,4],
    "city":["ajmer","kota","matura","up"]}
dt

{'Name': ['nikki', 'pragati', 'arushi', 'krtik'],
 'Branch': ['cse', 'IT', 'ECE', 'CSE'],
 'class': [1, 2, 3, 4],
 'city': ['ajmer', 'kota', 'matura', 'up']}

CREATING THE DATAFRAMES

In [210]:
df=pd.DataFrame(dt)
df

      Name Branch  class    city
0    nikki    cse      1   ajmer
1  pragati     IT      2    kota
2   arushi    ECE      3  matura
3    krtik    CSE      4      up

TYPES IS DATFRAMES

In [211]:
type(df)

pandas.core.frame.DataFrame

TYPES IS SERIES

In [212]:
type(df["Name"])

pandas.core.series.Series

READING THE CSV FILES

In [6]:
df=pd.read_csv("Used_Bikes.csv")
df

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
...,...,...,...,...,...,...,...,...
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
32644,TVS Apache RTR 180cc,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS
32645,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero
32647,Bajaj Pulsar 150cc,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj

HEAD ->return top five row

In [214]:
df.head()  #by default it will return top five row

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha

TAIL ->return last five row

In [215]:
df.tail()   #by default it will return last five row

,bike_name,price,city,kms_driven,owner,age,power,brand
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
32644,TVS Apache RTR 180cc,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS
32645,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero
32647,Bajaj Pulsar 150cc,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj

In [216]:
df.tail(8)

,bike_name,price,city,kms_driven,owner,age,power,brand
32640,Hero Passion Pro 100cc,32000.0,Delhi,12000.0,First Owner,6.0,100.0,Hero
32641,Bajaj Avenger 220cc,41000.0,Delhi,20245.0,Second Owner,11.0,220.0,Bajaj
32642,Hero Passion 100cc,15000.0,Perumbavoor,35000.0,Second Owner,19.0,100.0,Hero
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
32644,TVS Apache RTR 180cc,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS
32645,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero
32647,Bajaj Pulsar 150cc,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj

INFO ->gives the information

In [217]:
df.info()  # gives the information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32648 entries, 0 to 32647
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   32648 non-null  object
 1   price       32648 non-null  float64
 2   city        32648 non-null  object
 3   kms_driven  32648 non-null  float64
 4   owner       32648 non-null  object
 5   age         32648 non-null  float64
 6   power       32648 non-null  float64
 7   brand       32648 non-null  object
dtypes: float64(4), object(4)
memory usage: 2.0+ MB

ACCESSING

In [218]:
# accessing 
df.price

0         35000.0
1        119900.0
2        600000.0
3         65000.0
4         80000.0
           ...
32643     39000.0
32644     30000.0
32645     60000.0
32646     15600.0
32647     22000.0
Name: price, Length: 32648, dtype: float64

PRINTING DATATYPES ->SERIES

In [219]:
df["price"]   #datatyoe is series

0         35000.0
1        119900.0
2        600000.0
3         65000.0
4         80000.0
           ...
32643     39000.0
32644     30000.0
32645     60000.0
32646     15600.0
32647     22000.0
Name: price, Length: 32648, dtype: float64

PRINTING DATATYPES ->DATAFRAMES

In [220]:
df[["price"]]   #data is in dataframe

          price
0       35000.0
1      119900.0
2      600000.0
3       65000.0
4       80000.0
...         ...
32643   39000.0
32644   30000.0
32645   60000.0
32646   15600.0
32647   22000.0

[32648 rows x 1 columns]

ACCESSING THE ELEMENT

In [221]:
df[["price","city","brand"]]

          price       city          brand
0       35000.0  Ahmedabad            TVS
1      119900.0      Delhi  Royal Enfield
2      600000.0      Delhi        Triumph
3       65000.0  Bangalore            TVS
4       80000.0  Bangalore         Yamaha
...         ...        ...            ...
32643   39000.0      Delhi           Hero
32644   30000.0     Karnal            TVS
32645   60000.0      Delhi          Bajaj
32646   15600.0     Jaipur           Hero
32647   22000.0       Pune          Bajaj

[32648 rows x 3 columns]

LOC AND ILOC FUNCTION

In [222]:
#loc and iloc location wise uses
# df.loc[10:20]    #row filter
# df.loc[10:20,0:5]   #columne filter error
# loc[row_index,column_labels]
df.loc[10:20,["bike_name","price","city","kms_driven"]]

                   bike_name     price       city  kms_driven
10  Yamaha YZF-R15 2.0 150cc   72000.0  Bangalore     20000.0
11         Yamaha FZ25 250cc   95000.0  Bangalore      9665.0
12        Bajaj Pulsar NS200   78000.0  Bangalore      9900.0
13       Bajaj Discover 100M   29499.0      Delhi     20000.0
14       Bajaj Discover 125M   29900.0      Delhi     20000.0
15    Bajaj Pulsar NS200 ABS   90000.0  Bangalore     11574.0
16    Bajaj Pulsar RS200 ABS  120000.0  Bangalore     23000.0
17    Suzuki Gixxer SF 150cc   48000.0     Mumbai     24725.0
18        Benelli 302R 300CC  240000.0     Mumbai     15025.0
19       Bajaj Discover 125M   29900.0      Delhi     20000.0
20    Bajaj Pulsar RS200 ABS  120000.0  Bangalore     23000.0

LOC ->loc[row_index,column_labels]

In [223]:
df.loc[20:30,["owner","age","power","brand"]]

           owner   age  power          brand
20   First Owner   3.0  200.0          Bajaj
21   First Owner   5.0  150.0         Suzuki
22   First Owner   2.0  110.0           Hero
23   First Owner   5.0  500.0  Royal Enfield
24   First Owner   6.0  150.0         Yamaha
25   First Owner   4.0  200.0          Bajaj
26   First Owner  16.0  125.0           Hero
27  Second Owner   7.0  125.0          Honda
28   First Owner   8.0  150.0          Bajaj
29   First Owner   2.0  160.0          Honda
30   First Owner   3.0  200.0          Bajaj

SLICING

In [224]:
df.iloc[20:30,3:6]  #Slicing

    kms_driven         owner   age
20     23000.0   First Owner   3.0
21     24725.0   First Owner   5.0
22      3500.0   First Owner   2.0
23     24520.0   First Owner   5.0
24     23000.0   First Owner   6.0
25      9900.0   First Owner   4.0
26     29305.0   First Owner  16.0
27     30500.0  Second Owner   7.0
28     19000.0   First Owner   8.0
29      9100.0   First Owner   2.0

MINIMUM

In [225]:
df["price"].min()

np.float64(4400.0)

MAXIMUM

In [226]:
df["price"].max()

np.float64(1900000.0)

MEAN

In [227]:
df["price"].mean()

np.float64(68295.41763660868)

MEDIAN

In [228]:
df["price"].median()

np.float64(43000.0)

VARIANCE

In [229]:
df["price"].var()

np.float64(8229863516.012512)

STANDARD DEVIATION

In [230]:
df["price"].std()

np.float64(90718.59520524176)

ONLY COLUMNS ACCESSING

In [231]:
df.columns

Index(['bike_name', 'price', 'city', 'kms_driven', 'owner', 'age', 'power',
       'brand'],
      dtype='object')

CHANGING THE COLUMNS NAME

In [232]:
df.columns=['bike_name', 'bike_price', 'city', 'kms_driven', 'owner', 'bike_age', 'power',
       'brand']
df.columns

Index(['bike_name', 'bike_price', 'city', 'kms_driven', 'owner', 'bike_age',
       'power', 'brand'],
      dtype='object')

In [233]:
df.head(2)

,bike_name,bike_price,city,kms_driven,owner,bike_age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield

DEFINING SHAPE ->Return a tuple representing the dimensionality of the DataFrame

In [234]:
df.shape  #gives row and column

(32648, 8)

DTYPES->Return the dtypes in the DataFrame

In [235]:
df.dtypes  #in numpy there we write dtype and in pandas we write datatypes

bike_name      object
bike_price    float64
city           object
kms_driven    float64
owner          object
bike_age      float64
power         float64
brand          object
dtype: object

FILTERS THE DATATYPES

In [236]:
#filter the data type 
# df["bike_price"] <=50000
under_50K=df[df["bike_price"] <=50000]
under_50K.head()

,bike_name,bike_price,city,kms_driven,owner,bike_age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
7,Hero Splendor Plus Self Alloy 100cc,45000.0,Delhi,12645.0,First Owner,3.0,100.0,Hero
13,Bajaj Discover 100M,29499.0,Delhi,20000.0,First Owner,8.0,100.0,Bajaj
14,Bajaj Discover 125M,29900.0,Delhi,20000.0,First Owner,7.0,125.0,Bajaj
17,Suzuki Gixxer SF 150cc,48000.0,Mumbai,24725.0,First Owner,5.0,150.0,Suzuki

MAXIMUM IN FILTER DATA

In [237]:
under_50K["bike_price"].max()

np.float64(50000.0)

SHAPE->Return a tuple representing the dimensionality of the DataFrame

In [238]:
under_50K.shape

(19114, 8)

VALUE COUNTS ->Return a Series containing the frequency of each distinct row in the Dataframe

In [239]:
under_50K["brand"].value_counts()

brand
Bajaj            7143
Hero             6258
Yamaha           2250
Suzuki           1295
Honda            1178
TVS               936
Mahindra           31
Royal Enfield      22
LML                 1
Name: count, dtype: int64

In [240]:
under_50K["owner"].value_counts()  #value_counts() gives the counts of how much the owner are there in a particular field

owner
First Owner             17447
Second Owner             1604
Third Owner                57
Fourth Owner Or More        6
Name: count, dtype: int64

In [241]:
# under_50K   owner==First Owner

FILTERING THE OWNER DATA

In [242]:
under_50K_first=under_50K[under_50K["owner"] =="First Owner"]
under_50K_first

,bike_name,bike_price,city,kms_driven,owner,bike_age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
7,Hero Splendor Plus Self Alloy 100cc,45000.0,Delhi,12645.0,First Owner,3.0,100.0,Hero
13,Bajaj Discover 100M,29499.0,Delhi,20000.0,First Owner,8.0,100.0,Bajaj
14,Bajaj Discover 125M,29900.0,Delhi,20000.0,First Owner,7.0,125.0,Bajaj
17,Suzuki Gixxer SF 150cc,48000.0,Mumbai,24725.0,First Owner,5.0,150.0,Suzuki
...,...,...,...,...,...,...,...,...
32640,Hero Passion Pro 100cc,32000.0,Delhi,12000.0,First Owner,6.0,100.0,Hero
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
32644,TVS Apache RTR 180cc,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero
32647,Bajaj Pulsar 150cc,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj

SHAPE OF THE FILTER DATA OF OWNER

In [243]:
under_50K_first.shape

(17447, 8)

MINIMUM OF FILTER DATA

In [244]:
under_50K_first["bike_price"].min()

np.float64(4400.0)

FILTER DATA FETCHING THE BRAND DATA

In [245]:
under_50K_first["brand"]

0           TVS
7          Hero
13        Bajaj
14        Bajaj
17       Suzuki
          ...
32640      Hero
32643      Hero
32644       TVS
32646      Hero
32647     Bajaj
Name: brand, Length: 17447, dtype: object

NUNIQUE->Count number of distinct elements in specified axis

In [246]:
under_50K_first["brand"].nunique() #Count number of distinct elements in specified axis

9

In [247]:
df["brand"].nunique()

23

UNIQUE->Uniques are returned in order of appearance. This does NOT sort

In [248]:
df["brand"].unique() #Uniques are returned in order of appearance. This does NOT sort

array(['TVS', 'Royal Enfield', 'Triumph', 'Yamaha', 'Honda', 'Hero',
       'Bajaj', 'Suzuki', 'Benelli', 'KTM', 'Mahindra', 'Kawasaki',
       'Ducati', 'Hyosung', 'Harley-Davidson', 'Jawa', 'BMW', 'Indian',
       'Rajdoot', 'LML', 'Yezdi', 'MV', 'Ideal'], dtype=object)

ACCESSING THE BIKE_PRICE LESS THAN 100000,OWNER AS FIRST OWNER AND BIKE_AGE AS LESS THAN 2 AND PRINTING IN l

In [249]:
l=df[(df["bike_price"]<=100000)&(df["owner"]=="First Owner")&(df["bike_age"]<=2)].shape
l

(166, 8)

ACCESSING THE BIKE_PRICE LESS THAN 100000,OWNER AS FIRST OWNER AND BIKE_AGE AS LESS THAN 2 AND BRAND AS BAJAJ AND PRINTING IN SHAPE IN K

In [250]:
k=df[(df["bike_price"]<=100000)&(df["owner"]=="First Owner")&(df["bike_age"]<=2)&(df["brand"]=="Bajaj")].shape
k

(41, 8)

 ####                                                    _______NEXT DAY_______

IMPORT THE  PANDAS AND READ THE FILE

In [252]:
df=pd.read_csv("Used_Bikes.csv")
df

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
...,...,...,...,...,...,...,...,...
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
32644,TVS Apache RTR 180cc,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS
32645,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero
32647,Bajaj Pulsar 150cc,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj

PRINYING THE DTYPES

In [253]:
df.dtypes

bike_name      object
price         float64
city           object
kms_driven    float64
owner          object
age           float64
power         float64
brand          object
dtype: object

ACCESSING THE COLUMNS-> PRICE, KMS_DRIVEN, AGE, POWER

In [254]:
df[["price","kms_driven","age","power"]]

          price  kms_driven   age  power
0       35000.0     17654.0   3.0  110.0
1      119900.0     11000.0   4.0  350.0
2      600000.0       110.0   8.0  675.0
3       65000.0     16329.0   4.0  180.0
4       80000.0     10000.0   3.0  150.0
...         ...         ...   ...    ...
32643   39000.0     22000.0   4.0  100.0
32644   30000.0      6639.0   9.0  180.0
32645   60000.0     20373.0   6.0  220.0
32646   15600.0     84186.0  16.0  125.0
32647   22000.0     60857.0  13.0  150.0

[32648 rows x 4 columns]

SELECTING THE CATEGORIAL OBJECT FROM THE FILE ->all the string values are printed

In [255]:
categorial=df.select_dtypes(include="O")  #0->object    #all the string values are printed
categorial.head()

                              bike_name       city        owner          brand
0    TVS Star City Plus Dual Tone 110cc  Ahmedabad  First Owner            TVS
1           Royal Enfield Classic 350cc      Delhi  First Owner  Royal Enfield
2                  Triumph Daytona 675R      Delhi  First Owner        Triumph
3                  TVS Apache RTR 180cc  Bangalore  First Owner            TVS
4  Yamaha FZ S V 2.0 150cc-Ltd. Edition  Bangalore  First Owner         Yamaha

SELECTING THE NUMERICAL OBJECT FROM THE FILE ->all the numerical values are printed

In [256]:
numercial=df.select_dtypes(exclude="O")   #all the numerical value are printed
numercial.head()

      price  kms_driven  age  power
0   35000.0     17654.0  3.0  110.0
1  119900.0     11000.0  4.0  350.0
2  600000.0       110.0  8.0  675.0
3   65000.0     16329.0  4.0  180.0
4   80000.0     10000.0  3.0  150.0

In [257]:
# 8column & 8 row

CONCATENATION THE TWO CATEGORIAL AND NUMERICAL OBJECT

In [258]:
combined_df=pd.concat([categorial,numercial],axis="columns")   #it combined all the values
combined_df.head()

,bike_name,city,owner,brand,price,kms_driven,age,power
0,TVS Star City Plus Dual Tone 110cc,Ahmedabad,First Owner,TVS,35000.0,17654.0,3.0,110.0
1,Royal Enfield Classic 350cc,Delhi,First Owner,Royal Enfield,119900.0,11000.0,4.0,350.0
2,Triumph Daytona 675R,Delhi,First Owner,Triumph,600000.0,110.0,8.0,675.0
3,TVS Apache RTR 180cc,Bangalore,First Owner,TVS,65000.0,16329.0,4.0,180.0
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,Bangalore,First Owner,Yamaha,80000.0,10000.0,3.0,150.0

CATEGORAIL SHAPE

categorial.shape

NUMERICAL SHAPE

In [260]:
numercial.shape

(32648, 4)

DROP KEYWORD ->by default it delete a row

In [261]:
df.drop("bike_name",axis="columns") #by default it drop a row by as we donot have a row then you have to give axis to column

,price,city,kms_driven,owner,age,power,brand
0,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
...,...,...,...,...,...,...,...
32643,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
32644,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS
32645,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj
32646,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero
32647,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj

INPLACE->DELETE PERMANENTELY

In [262]:
df.drop("bike_name",axis="columns",inplace=True) #inplace delete from the data fully but when we print only axis then it will only drop for sometime
df.head()

      price       city  kms_driven        owner  age  power          brand
0   35000.0  Ahmedabad     17654.0  First Owner  3.0  110.0            TVS
1  119900.0      Delhi     11000.0  First Owner  4.0  350.0  Royal Enfield
2  600000.0      Delhi       110.0  First Owner  8.0  675.0        Triumph
3   65000.0  Bangalore     16329.0  First Owner  4.0  180.0            TVS
4   80000.0  Bangalore     10000.0  First Owner  3.0  150.0         Yamaha

AXIS KEYWORD->Assign desired index to given axis

In [263]:
df.drop(['age','power'],axis='columns')

          price       city  kms_driven        owner          brand
0       35000.0  Ahmedabad     17654.0  First Owner            TVS
1      119900.0      Delhi     11000.0  First Owner  Royal Enfield
2      600000.0      Delhi       110.0  First Owner        Triumph
3       65000.0  Bangalore     16329.0  First Owner            TVS
4       80000.0  Bangalore     10000.0  First Owner         Yamaha
...         ...        ...         ...          ...            ...
32643   39000.0      Delhi     22000.0  First Owner           Hero
32644   30000.0     Karnal      6639.0  First Owner            TVS
32645   60000.0      Delhi     20373.0  First Owner          Bajaj
32646   15600.0     Jaipur     84186.0  First Owner           Hero
32647   22000.0       Pune     60857.0  First Owner          Bajaj

[32648 rows x 5 columns]

ADDING THE COLUMN_NAME DUMMY IN WHOLE LIST

In [264]:
# to add columns in dataframe
df["dummy"]="upflairs"
df
# feature engineering = to generte new column from availble columns and feature is same as columns

,price,city,kms_driven,owner,age,power,brand,dummy
0,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS,upflairs
1,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield,upflairs
2,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph,upflairs
3,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS,upflairs
4,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha,upflairs
...,...,...,...,...,...,...,...,...
32643,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero,upflairs
32644,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS,upflairs
32645,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj,upflairs
32646,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero,upflairs
32647,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj,upflairs

### FEATURE ENGINEERING

ADDING 1000 TO PRICES AND ASSIGN IT IN FAKE_PRICES

In [266]:
df['fake_price']=df['price']+1000  #add 1000 fake price in price and print and make a new fake price column

In [267]:
df

,price,city,kms_driven,owner,age,power,brand,dummy,fake_price
0,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS,upflairs,36000.0
1,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield,upflairs,120900.0
2,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph,upflairs,601000.0
3,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS,upflairs,66000.0
4,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha,upflairs,81000.0
...,...,...,...,...,...,...,...,...,...
32643,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero,upflairs,40000.0
32644,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS,upflairs,31000.0
32645,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj,upflairs,61000.0
32646,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero,upflairs,16600.0
32647,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj,upflairs,23000.0

DEDELETING THE FAKE_PRICE AND DUMMY COLUMNS

In [268]:
df.drop(['fake_price','dummy'],axis='columns',inplace=True)
df.head()

      price       city  kms_driven        owner  age  power          brand
0   35000.0  Ahmedabad     17654.0  First Owner  3.0  110.0            TVS
1  119900.0      Delhi     11000.0  First Owner  4.0  350.0  Royal Enfield
2  600000.0      Delhi       110.0  First Owner  8.0  675.0        Triumph
3   65000.0  Bangalore     16329.0  First Owner  4.0  180.0            TVS
4   80000.0  Bangalore     10000.0  First Owner  3.0  150.0         Yamaha

FILTER KTM DATA FROM BRAND

In [269]:
df[df["brand"]=="KTM"]

          price        city  kms_driven         owner  age  power brand
33     180000.0        Pune     17700.0   First Owner  4.0  390.0   KTM
35      70000.0      Nashik    100000.0  Second Owner  8.0  200.0   KTM
39     179000.0   Bangalore      3400.0   First Owner  2.0  200.0   KTM
65      94700.0    Baripara     32700.0   First Owner  4.0  200.0   KTM
83     130000.0  Gandhidham     17500.0  Second Owner  4.0  250.0   KTM
...         ...         ...         ...           ...  ...    ...   ...
32541  196700.0      Mumbai     13216.0   First Owner  4.0  390.0   KTM
32560  196700.0      Mumbai     13216.0   First Owner  4.0  390.0   KTM
32579  196700.0      Mumbai     13216.0   First Owner  4.0  390.0   KTM
32598  196700.0      Mumbai     13216.0   First Owner  4.0  390.0   KTM
32636  196700.0      Mumbai     13216.0   First Owner  4.0  390.0   KTM

[1077 rows x 7 columns]

VALUE COUNTS ->Return a Series containing the frequency of each distinct row in the Dataframe

In [270]:
df["brand"].value_counts()

brand
Bajaj              11213
Hero                6368
Royal Enfield       4178
Yamaha              3916
Honda               2108
Suzuki              1464
TVS                 1247
KTM                 1077
Harley-Davidson      737
Kawasaki              79
Hyosung               64
Benelli               56
Mahindra              55
Triumph               26
Ducati                22
BMW                   16
Jawa                  10
MV                     4
Indian                 3
Ideal                  2
Rajdoot                1
Yezdi                  1
LML                    1
Name: count, dtype: int64

SHAPE OF DF

In [271]:
df.shape

(32648, 7)

DUPLICATED->Return boolean Series denoting duplicate rows

In [272]:
df.duplicated() #Return boolean Series denoting duplicate rows

0        False
1        False
2        False
3        False
4        False
         ...
32643     True
32644     True
32645     True
32646     True
32647     True
Length: 32648, dtype: bool

DUPLICATED().SUM()->count the number of duplicate rows in a DataFrame

In [273]:
df.duplicated().sum()  #count the number of duplicate rows in a DataFrame

np.int64(25328)

DROP_DUPLICATES->Return DataFrame with duplicate rows removed

In [274]:
df.drop_duplicates()  #Return DataFrame with duplicate rows removed

,price,city,kms_driven,owner,age,power,brand
0,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
...,...,...,...,...,...,...,...
9362,25000.0,Delhi,48587.0,First Owner,8.0,150.0,Hero
9369,35000.0,Bangalore,60000.0,First Owner,9.0,220.0,Bajaj
9370,450000.0,Jodhpur,3430.0,First Owner,4.0,750.0,Harley-Davidson
9371,139000.0,Hyderabad,21300.0,First Owner,4.0,400.0,Bajaj
9372,80000.0,Hyderabad,7127.0,First Owner,5.0,220.0,Bajaj

PRINT INPLACE IN DROP_DUPLICATES

In [275]:
df.drop_duplicates(inplace=True)

SHAPE OF DF

In [276]:
df.shape

(7320, 7)

DUPLICATED SUM

In [277]:
df.duplicated().sum()

np.int64(0)

COMBINED_DF DUPLICATED SUM

In [278]:
combined_df.duplicated().sum()

np.int64(25324)

PRINT FIRST 5 ELEMENT OF COMBINED_DF

In [279]:
combined_df[combined_df.duplicated()].head()

,bike_name,city,owner,brand,price,kms_driven,age,power
19,Bajaj Discover 125M,Delhi,First Owner,Bajaj,29900.0,20000.0,7.0,125.0
20,Bajaj Pulsar RS200 ABS,Bangalore,First Owner,Bajaj,120000.0,23000.0,3.0,200.0
21,Suzuki Gixxer SF 150cc,Mumbai,First Owner,Suzuki,48000.0,24725.0,5.0,150.0
25,Bajaj Pulsar NS200,Bangalore,First Owner,Bajaj,78000.0,9900.0,4.0,200.0
90,Royal Enfield Thunderbird 350cc,Mumbai,First Owner,Royal Enfield,71800.0,43500.0,7.0,350.0

VALUE_COUNTS OF BRAND

In [280]:
df["brand"].value_counts()

brand
Bajaj              2081
Royal Enfield      1344
Hero               1141
Honda               676
Yamaha              651
TVS                 481
KTM                 375
Suzuki              203
Harley-Davidson      91
Kawasaki             61
Hyosung              52
Mahindra             50
Benelli              46
Triumph              21
Ducati               20
BMW                  10
Jawa                  7
Indian                3
MV                    3
Rajdoot               1
LML                   1
Yezdi                 1
Ideal                 1
Name: count, dtype: int64

FILTER THE BRAND THROUGH KTM , SUZUKI, JAWA

In [281]:
filter_df=df[(df["brand"]=="KTM")|(df["brand"]=="Suzuki")|(df["brand"]=="Jawa")]   #filter the list data through giving diffent brand
filter_df

         price       city  kms_driven         owner  age  power   brand
17     48000.0     Mumbai     24725.0   First Owner  5.0  150.0  Suzuki
33    180000.0       Pune     17700.0   First Owner  4.0  390.0     KTM
35     70000.0     Nashik    100000.0  Second Owner  8.0  200.0     KTM
39    179000.0  Bangalore      3400.0   First Owner  2.0  200.0     KTM
49     97000.0      Delhi      4400.0   First Owner  3.0  150.0  Suzuki
...        ...        ...         ...           ...  ...    ...     ...
9195   70000.0      Thane     49347.0   First Owner  9.0  200.0     KTM
9255  135000.0  Bangalore      1050.0   First Owner  3.0  125.0     KTM
9281   63000.0  Bangalore     19100.0   First Owner  5.0  150.0  Suzuki
9282  139100.0      Delhi     25500.0   First Owner  5.0  390.0     KTM
9348  195000.0     Mumbai      4568.0   First Owner  4.0  390.0     KTM

[585 rows x 7 columns]

ISIN FUNCTION->Whether each element in the DataFrame is contained in values

In [282]:
brand_ls=["KTM","Suzuki","Jawa"]  #Whether each element in the DataFrame is contained in values.
df[df["brand"].isin(brand_ls)]

         price       city  kms_driven         owner  age  power   brand
17     48000.0     Mumbai     24725.0   First Owner  5.0  150.0  Suzuki
33    180000.0       Pune     17700.0   First Owner  4.0  390.0     KTM
35     70000.0     Nashik    100000.0  Second Owner  8.0  200.0     KTM
39    179000.0  Bangalore      3400.0   First Owner  2.0  200.0     KTM
49     97000.0      Delhi      4400.0   First Owner  3.0  150.0  Suzuki
...        ...        ...         ...           ...  ...    ...     ...
9195   70000.0      Thane     49347.0   First Owner  9.0  200.0     KTM
9255  135000.0  Bangalore      1050.0   First Owner  3.0  125.0     KTM
9281   63000.0  Bangalore     19100.0   First Owner  5.0  150.0  Suzuki
9282  139100.0      Delhi     25500.0   First Owner  5.0  390.0     KTM
9348  195000.0     Mumbai      4568.0   First Owner  4.0  390.0     KTM

[585 rows x 7 columns]

FILTER THE DATA THROUGH CITY AND GIVE THE VALUE_COUNTS

In [283]:
filter_df
city_name=["Mumbai","Pune","Nashik"]
filter_df[filter_df["city"].isin(city_name)]["city"].value_counts()

city
Mumbai    96
Pune      39
Nashik     3
Name: count, dtype: int64

ONLY PRINT KEYS OF CITY

In [284]:
filter_df["city"].value_counts().keys()

Index(['Delhi', 'Mumbai', 'Bangalore', 'Pune', 'Hyderabad', 'Chennai',
       'Ghaziabad', 'Gurgaon', 'Ahmedabad', 'Jaipur',
       ...
       'Jodhpur', 'Challakere', 'Jabalpur', 'Visakhapatnam', 'Hooghly',
       'Bhubaneswar', 'Raigarh(mh)', 'Adyar', 'Pondicherry', 'Berhampore'],
      dtype='object', name='city', length=112)

FILTERING THE DATA OF JAIPUR

In [285]:
jaipur=df[df["city"]=="Jaipur"]
jaipur

         price    city  kms_driven         owner   age  power            brand
47     28000.0  Jaipur     45000.0   First Owner   2.0  110.0         Mahindra
134    47000.0  Jaipur     70000.0   First Owner   6.0  150.0           Suzuki
166   123600.0  Jaipur      7702.0   First Owner   3.0  350.0    Royal Enfield
189   435000.0  Jaipur      5550.0  Second Owner   7.0  883.0  Harley-Davidson
490    55000.0  Jaipur      2000.0   First Owner   9.0  150.0            Honda
...        ...     ...         ...           ...   ...    ...              ...
9161   41000.0  Jaipur      8000.0   First Owner   6.0  110.0         Mahindra
9187  520000.0  Jaipur       399.0   First Owner   2.0  750.0  Harley-Davidson
9197   90000.0  Jaipur     17000.0   First Owner   7.0  350.0    Royal Enfield
9198   83800.0  Jaipur     21540.0  Second Owner  10.0  350.0    Royal Enfield
9259   37000.0  Jaipur      8030.0   First Owner   4.0  110.0           Yamaha

[299 rows x 7 columns]

PLACES THE VALUE_COUNTS

In [286]:
jaipur["brand"].value_counts()

brand
Hero               91
Bajaj              63
Honda              39
TVS                29
Yamaha             27
Royal Enfield      23
KTM                 7
Mahindra            6
Harley-Davidson     6
Suzuki              4
Benelli             2
Kawasaki            1
Hyosung             1
Name: count, dtype: int64

FILTERING THE DATA THROUGH BRAND

In [287]:
brand_ls=["KTM","TVS","Suzuki"]
jaipur_bike=jaipur[jaipur["brand"].isin(brand_ls)]
jaipur_bike

          price    city  kms_driven         owner   age   power   brand
134     47000.0  Jaipur     70000.0   First Owner   6.0   150.0  Suzuki
617   1260000.0  Jaipur     17000.0   First Owner   4.0  1300.0  Suzuki
888    147000.0  Jaipur     15000.0   First Owner   6.0   390.0     KTM
1132    98000.0  Jaipur       749.0   First Owner   1.0   160.0     TVS
1304    63000.0  Jaipur      1639.0   First Owner   4.0   160.0     TVS
2070   185000.0  Jaipur      2845.0   First Owner   3.0   310.0     TVS
2302    19542.0  Jaipur     56592.0   First Owner   9.0   160.0     TVS
3364    30000.0  Jaipur     27000.0   First Owner   6.0   110.0     TVS
3904    51000.0  Jaipur     18314.0   First Owner   7.0   160.0     TVS
3907    47000.0  Jaipur     26000.0   First Owner   8.0   160.0     TVS
3920    26500.0  Jaipur      2342.0   First Owner   9.0   110.0     TVS
3922    26000.0  Jaipur     24000.0   First Owner   7.0   110.0     TVS
3936    70000.0  Jaipur     28112.0   First Owner   4.0   150.0  Suzuki
4063    33000.0  Jaipur     18677.0   First Owner   6.0   100.0     TVS
4368    86000.0  Jaipur     12000.0   First Owner   3.0   180.0     TVS
4369    78000.0  Jaipur     23918.0   First Owner   5.0   200.0     TVS
4371    68000.0  Jaipur     11123.0   First Owner   5.0   160.0     TVS
4607    23000.0  Jaipur     28895.0   First Owner   8.0   100.0     TVS
4851    45000.0  Jaipur     20431.0   First Owner   7.0   160.0     TVS
4886    59900.0  Jaipur     32000.0   First Owner   5.0   180.0     TVS
4945   200000.0  Jaipur     11700.0   First Owner   4.0   390.0     KTM
4948   175000.0  Jaipur     10880.0   First Owner   4.0   390.0     KTM
5970    22000.0  Jaipur     31000.0   First Owner  10.0   110.0     TVS
6068    31000.0  Jaipur     20000.0   First Owner   7.0   100.0     TVS
6073   190000.0  Jaipur      7902.0   First Owner   2.0   200.0     KTM
6075    25000.0  Jaipur     22620.0   First Owner   9.0   100.0     TVS
6076    24000.0  Jaipur     20885.0   First Owner  14.0   180.0     TVS
6159   135000.0  Jaipur     12507.0   First Owner   4.0   250.0     KTM
6301    34000.0  Jaipur     11536.0   First Owner   5.0   100.0     TVS
6310    34000.0  Jaipur      4474.0   First Owner   3.0   100.0     TVS
6415    58000.0  Jaipur     18583.0   First Owner   6.0   180.0     TVS
6596    48000.0  Jaipur     23541.0   First Owner   6.0   150.0  Suzuki
6734   128000.0  Jaipur     15000.0   First Owner   4.0   200.0     KTM
7311    70000.0  Jaipur    207102.0   First Owner   2.0   180.0     TVS
7561   150000.0  Jaipur     12500.0   First Owner   4.0   250.0     KTM
7591    65000.0  Jaipur     26454.0   First Owner   3.0   180.0     TVS
7712    31599.0  Jaipur     19111.0   First Owner   8.0   100.0     TVS
8074    65000.0  Jaipur     12061.0   First Owner   4.0   180.0     TVS
8924    51000.0  Jaipur     23000.0  Second Owner   6.0   160.0     TVS
9157    32000.0  Jaipur     17870.0   First Owner   7.0   110.0     TVS

SHAPE OF FILTER DATA

In [288]:
jaipur_bike.shape

(40, 7)

PRICE SSOULD BE LESS THAN 70000 AND PRINTING THE SHAPE

In [289]:
bike_70K=jaipur_bike[jaipur_bike["price"]<=70000]
bike_70K.shape

(28, 7)

FILTERING THE DATA OF OWNER AS FIRST OWNER ,AGE OF BIKE LESS THAN 2 AND  POWER IS GREATER THEN 100

In [290]:
bike_70K[(bike_70K["owner"]=="First Owner")&(bike_70K["age"]<=2)&(bike_70K["power"]<=100)]

Empty DataFrame
Columns: [price, city, kms_driven, owner, age, power, brand]
Index: []

PRICES IS SOTED IN ASCENDING ORDER

In [291]:
jaipur.sort_values(by="price")  #ascending order

,price,city,kms_driven,owner,age,power,brand
2696,14000.0,Jaipur,70756.0,First Owner,13.0,100.0,Hero
9029,14000.0,Jaipur,50000.0,Second Owner,19.0,100.0,Hero
3365,15000.0,Jaipur,52391.0,First Owner,15.0,125.0,Hero
2983,15000.0,Jaipur,48000.0,First Owner,17.0,100.0,Bajaj
4092,15244.0,Jaipur,40320.0,First Owner,15.0,125.0,Hero
...,...,...,...,...,...,...,...
189,435000.0,Jaipur,5550.0,Second Owner,7.0,883.0,Harley-Davidson
2599,445600.0,Jaipur,1500.0,First Owner,5.0,750.0,Harley-Davidson
7650,478000.0,Jaipur,1234.0,First Owner,3.0,650.0,Kawasaki
9187,520000.0,Jaipur,399.0,First Owner,2.0,750.0,Harley-Davidson
617,1260000.0,Jaipur,17000.0,First Owner,4.0,1300.0,Suzuki

MAKING THE DATA IN ASCENDING ORDER

In [292]:
jaipur.sort_values(by="price",ascending=False) #when you wanted to print the element in descending order

,price,city,kms_driven,owner,age,power,brand
617,1260000.0,Jaipur,17000.0,First Owner,4.0,1300.0,Suzuki
9187,520000.0,Jaipur,399.0,First Owner,2.0,750.0,Harley-Davidson
7650,478000.0,Jaipur,1234.0,First Owner,3.0,650.0,Kawasaki
2599,445600.0,Jaipur,1500.0,First Owner,5.0,750.0,Harley-Davidson
189,435000.0,Jaipur,5550.0,Second Owner,7.0,883.0,Harley-Davidson
...,...,...,...,...,...,...,...
4092,15244.0,Jaipur,40320.0,First Owner,15.0,125.0,Hero
2983,15000.0,Jaipur,48000.0,First Owner,17.0,100.0,Bajaj
3365,15000.0,Jaipur,52391.0,First Owner,15.0,125.0,Hero
9029,14000.0,Jaipur,50000.0,Second Owner,19.0,100.0,Hero
2696,14000.0,Jaipur,70756.0,First Owner,13.0,100.0,Hero

SORT THE VALUES

In [293]:
print(jaipur.sort_values)

<bound method DataFrame.sort_values of          price    city  kms_driven         owner   age  power            brand
47     28000.0  Jaipur     45000.0   First Owner   2.0  110.0         Mahindra
134    47000.0  Jaipur     70000.0   First Owner   6.0  150.0           Suzuki
166   123600.0  Jaipur      7702.0   First Owner   3.0  350.0    Royal Enfield
189   435000.0  Jaipur      5550.0  Second Owner   7.0  883.0  Harley-Davidson
490    55000.0  Jaipur      2000.0   First Owner   9.0  150.0            Honda
...        ...     ...         ...           ...   ...    ...              ...
9161   41000.0  Jaipur      8000.0   First Owner   6.0  110.0         Mahindra
9187  520000.0  Jaipur       399.0   First Owner   2.0  750.0  Harley-Davidson
9197   90000.0  Jaipur     17000.0   First Owner   7.0  350.0    Royal Enfield
9198   83800.0  Jaipur     21540.0  Second Owner  10.0  350.0    Royal Enfield
9259   37000.0  Jaipur      8030.0   First Owner   4.0  110.0           Yamaha

[299 rows x 7 columns]>

ISIN FUNCTION USED FOR DELHI DATA FILTERING

In [294]:
city_ls=["Delhi"]
d=df[df["city"].isin(city_ls)]   #
d

         price   city  kms_driven         owner  age  power          brand
1     119900.0  Delhi     11000.0   First Owner  4.0  350.0  Royal Enfield
2     600000.0  Delhi       110.0   First Owner  8.0  675.0        Triumph
5      53499.0  Delhi     25000.0   First Owner  6.0  150.0         Yamaha
6      85000.0  Delhi      8200.0   First Owner  3.0  160.0          Honda
7      45000.0  Delhi     12645.0   First Owner  3.0  100.0           Hero
...        ...    ...         ...           ...  ...    ...            ...
9336  220000.0  Delhi      7130.0   First Owner  5.0  320.0         Yamaha
9338  138000.0  Delhi      5000.0   First Owner  5.0  410.0  Royal Enfield
9340   34400.0  Delhi     24513.0  Second Owner  8.0  150.0          Honda
9344   80000.0  Delhi     56968.0   First Owner  8.0  350.0  Royal Enfield
9362   25000.0  Delhi     48587.0   First Owner  8.0  150.0           Hero

[1424 rows x 7 columns]

PRINT FIRST TEN VALUES

In [295]:
v=d.sort_values(by='price',ascending=False).head(10)

MAKE THE FILE IN CSV FILES

In [296]:
v.to_csv('delhi_top_ten.csv',index=False)  #to make the csv files

VALUE_COUNTS

In [297]:
v['brand'].value_counts()

brand
BMW                3
Ducati             2
Suzuki             2
Yamaha             1
Harley-Davidson    1
Triumph            1
Name: count, dtype: int64

###                                                             ___________NEXT DAY___________

In [1]:
import pandas as pd

IMPORT PANDAS AND READ THE CSV FILES

In [299]:
df=pd.read_csv("Used_Bikes.csv")
df.head()

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha

ISNULL FUNCTION-> Detect missing values for an array-like object

In [300]:
df.isnull().sum()

bike_name     0
price         0
city          0
kms_driven    0
owner         0
age           0
power         0
brand         0
dtype: int64

IMPORTING NUMPY

In [1]:
import numpy as np

MAKING A DICTIONARY

In [3]:
dt = {"A":[1,2,4,np.nan,5],
      "B":[7,4,np.nan,9,2],
      "C":[np.nan,8,7,5,6],
      "D":[7,4,1,2,5]}
dt

{'A': [1, 2, 4, nan, 5],
 'B': [7, 4, nan, 9, 2],
 'C': [nan, 8, 7, 5, 6],
 'D': [7, 4, 1, 2, 5]}

CONVERTING DICTIONARY TO DATFRAME

In [ ]:
df=pd.DataFrame(dt)
df

     A    B    C  D
0  1.0  7.0  NaN  7
1  2.0  4.0  8.0  4
2  4.0  NaN  7.0  1
3  NaN  9.0  5.0  2
4  5.0  2.0  6.0  5

ISNULL().SUM()->HOW MANY NO. OF VALUES ARE NULL IN A PARTICULAR COLUMNS

In [ ]:
df.isnull().sum()

A    1
B    1
C    1
D    0
dtype: int64

MISSING VALUES HANDLE

In [ ]:
#missing value handle
# 1. remove the records
# 2.records fill

# Remove the records
#  not more then 5% or 12% records should by deleted

DROPNA()->to access in columns deletion

In [ ]:
df.dropna(axis="columns")  #to access in columns deletion

   D
0  7
1  4
2  1
3  2
4  5

AXIS THE COLUMNS THROUGH DROPNA

In [ ]:
df.dropna(axis=0)  #by default it remove the row

     A    B    C  D
1  2.0  4.0  8.0  4
4  5.0  2.0  6.0  5

FILLNA ->Fill NA/NaN values using the specified method

In [ ]:
#  Fill the records
#  by knowing the domain knowledge
df.fillna(100)

        A      B      C  D
0     1.0    7.0  100.0  7
1     2.0    4.0    8.0  4
2     4.0  100.0    7.0  1
3  1000.0    9.0    5.0  2
4     5.0    2.0    6.0  5

In [ ]:
# nan 96
# bad 35
# good 88
# bad 21
# good 84

FILL 100 IN A

In [ ]:
df["A"].fillna(1000)

0       1.0
1       2.0
2       4.0
3    1000.0
4       5.0
Name: A, dtype: float64

INPLACE THE VALUE

In [ ]:
df["A"].fillna(1000,inplace=True)
df

C:\Users\Pragati\AppData\Local\Temp\ipykernel_4068\1511175363.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["A"].fillna(1000,inplace=True)

        A    B    C  D
0     1.0  7.0  NaN  7
1     2.0  4.0  8.0  4
2     4.0  NaN  7.0  1
3  1000.0  9.0  5.0  2
4     5.0  2.0  6.0  5

In [ ]:

df
# numerical,categorial
# numercial===> mean,median
# categorial ==> mode

MEAN

In [ ]:
df["B"].mean()

np.float64(5.5)

MEDIAN

In [ ]:
df["B"].median()

np.float64(5.5)

MEAN OF B

In [ ]:
df["B"].fillna(df["B"].mean())
df

     A    B    C  D
0  1.0  7.0  NaN  7
1  2.0  4.0  8.0  4
2  4.0  NaN  7.0  1
3  NaN  9.0  5.0  2
4  5.0  2.0  6.0  5

In [ ]:
#  normally distributed data then we fill mean not normally distributed then we fill median

In [ ]:
df=pd.read_csv("Used_Bikes.csv")
df.head()

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha

GROUP THE PRICE AND PRINT MAXIMUM

In [ ]:
#  group by operation
df["price"].max()

np.float64(1900000.0)

PRINT DUPLICATED_SUM

In [ ]:
df.duplicated().sum()

np.int64(25324)

INPLACE DUPLICATED_SUM AS TRUE

In [ ]:
df.drop_duplicates(inplace=True)

VALUE_COUNTS

In [ ]:
df["brand"].value_counts()

brand
Bajaj              2081
Royal Enfield      1346
Hero               1142
Honda               676
Yamaha              651
TVS                 481
KTM                 375
Suzuki              203
Harley-Davidson      91
Kawasaki             61
Hyosung              53
Mahindra             50
Benelli              46
Triumph              21
Ducati               20
BMW                  10
Jawa                  7
Indian                3
MV                    3
Rajdoot               1
LML                   1
Yezdi                 1
Ideal                 1
Name: count, dtype: int64

GROUP THE DATA OF BRAND

In [ ]:
group=df.groupby("brand")
group

GROUP MAX

In [ ]:
group[["price"]].max()

                     price
brand
BMW              1800000.0
Bajaj             195000.0
Benelli           785000.0
Ducati           1500000.0
Harley-Davidson  1100000.0
Hero              104000.0
Honda             800000.0
Hyosung           493500.0
Ideal             100000.0
Indian           1900000.0
Jawa              223000.0
KTM               860000.0
Kawasaki         1100000.0
LML                 4400.0
MV               1500000.0
Mahindra          175000.0
Rajdoot            75000.0
Royal Enfield     285000.0
Suzuki           1260000.0
TVS               224000.0
Triumph          1300000.0
Yamaha           1550000.0
Yezdi              68000.0

GROUP MIN

In [ ]:
group[["price"]].min()

                    price
brand
BMW              255000.0
Bajaj              6400.0
Benelli          110700.0
Ducati           380000.0
Harley-Davidson  250000.0
Hero               5000.0
Honda             10000.0
Hyosung          120000.0
Ideal            100000.0
Indian           700000.0
Jawa             146000.0
KTM               55000.0
Kawasaki         110000.0
LML                4400.0
MV               950000.0
Mahindra          17800.0
Rajdoot           75000.0
Royal Enfield     33500.0
Suzuki             8000.0
TVS                5800.0
Triumph          500000.0
Yamaha             9400.0
Yezdi             68000.0

GROUP THE PRICES TO MIN IN MIN_PRICES

In [ ]:
min_price=group[["price"]].min()

MIN_PRICES INDEX

In [ ]:
min_price.index

Index(['BMW', 'Bajaj', 'Benelli', 'Ducati', 'Harley-Davidson', 'Hero', 'Honda',
       'Hyosung', 'Ideal', 'Indian', 'Jawa', 'KTM', 'Kawasaki', 'LML', 'MV',
       'Mahindra', 'Rajdoot', 'Royal Enfield', 'Suzuki', 'TVS', 'Triumph',
       'Yamaha', 'Yezdi'],
      dtype='object', name='brand')

RESET_INDEX->Reset the index of the DataFrame, and use the default one instead. If the DataFrame has a MultiIndex, this method can remove one or more levels

In [ ]:
min_price.reset_index()

              brand     price
0               BMW  255000.0
1             Bajaj    6400.0
2           Benelli  110700.0
3            Ducati  380000.0
4   Harley-Davidson  250000.0
5              Hero    5000.0
6             Honda   10000.0
7           Hyosung  120000.0
8             Ideal  100000.0
9            Indian  700000.0
10             Jawa  146000.0
11              KTM   55000.0
12         Kawasaki  110000.0
13              LML    4400.0
14               MV  950000.0
15         Mahindra   17800.0
16          Rajdoot   75000.0
17    Royal Enfield   33500.0
18           Suzuki    8000.0
19              TVS    5800.0
20          Triumph  500000.0
21           Yamaha    9400.0
22            Yezdi   68000.0

SORT THE MIN VALUES FROM ALL THE BIKES

In [ ]:
group[["price"]].min()["price"].min()

np.float64(4400.0)

AGG FUNCTION-> Aggregate using one or more operations over the specified axis
PRINTING ALL THE VALUES AS MIN, MAX,MEAN

In [ ]:
group["price"].agg(min_prices="min",max_prices="max",mean_prices="mean")

                 min_prices  max_prices   mean_prices
brand
BMW                255000.0   1800000.0  6.735000e+05
Bajaj                6400.0    195000.0  4.903128e+04
Benelli            110700.0    785000.0  2.983761e+05
Ducati             380000.0   1500000.0  9.005750e+05
Harley-Davidson    250000.0   1100000.0  4.734291e+05
Hero                 5000.0    104000.0  3.068307e+04
Honda               10000.0    800000.0  5.147068e+04
Hyosung            120000.0    493500.0  2.432084e+05
Ideal              100000.0    100000.0  1.000000e+05
Indian             700000.0   1900000.0  1.100000e+06
Jawa               146000.0    223000.0  1.884286e+05
KTM                 55000.0    860000.0  1.479469e+05
Kawasaki           110000.0   1100000.0  4.167116e+05
LML                  4400.0      4400.0  4.400000e+03
MV                 950000.0   1500000.0  1.266667e+06
Mahindra            17800.0    175000.0  7.005780e+04
Rajdoot             75000.0     75000.0  7.500000e+04
Royal Enfield       33500.0    285000.0  1.118775e+05
Suzuki               8000.0   1260000.0  1.048563e+05
TVS                  5800.0    224000.0  5.765194e+04
Triumph            500000.0   1300000.0  8.125238e+05
Yamaha               9400.0   1550000.0  7.011080e+04
Yezdi               68000.0     68000.0  6.800000e+04

VALUE_COUNTS

In [ ]:
df["brand"].value_counts()

brand
Bajaj              2081
Royal Enfield      1346
Hero               1142
Honda               676
Yamaha              651
TVS                 481
KTM                 375
Suzuki              203
Harley-Davidson      91
Kawasaki             61
Hyosung              53
Mahindra             50
Benelli              46
Triumph              21
Ducati               20
BMW                  10
Jawa                  7
Indian                3
MV                    3
Rajdoot               1
LML                   1
Yezdi                 1
Ideal                 1
Name: count, dtype: int64

PRINTING THE KEYS

In [ ]:
df["brand"].value_counts().keys()

Index(['Bajaj', 'Royal Enfield', 'Hero', 'Honda', 'Yamaha', 'TVS', 'KTM',
       'Suzuki', 'Harley-Davidson', 'Kawasaki', 'Hyosung', 'Mahindra',
       'Benelli', 'Triumph', 'Ducati', 'BMW', 'Jawa', 'Indian', 'MV',
       'Rajdoot', 'LML', 'Yezdi', 'Ideal'],
      dtype='object', name='brand')

PRINTING THE COLUMN

In [ ]:
df["brand"].value_counts().values

array([2081, 1346, 1142,  676,  651,  481,  375,  203,   91,   61,   53,
         50,   46,   21,   20,   10,    7,    3,    3,    1,    1,    1,
          1])

ADD THE COLUMNS

In [ ]:
#  add one more columns in dataframe as values

In [ ]:
group.get_group("KTM")

,bike_name,price,city,kms_driven,owner,age,power,brand
33,KTM RC 390cc,180000.0,Pune,17700.0,First Owner,4.0,390.0,KTM
35,KTM Duke 200cc,70000.0,Nashik,100000.0,Second Owner,8.0,200.0,KTM
39,KTM RC 200cc ABS,179000.0,Bangalore,3400.0,First Owner,2.0,200.0,KTM
65,KTM Duke 200cc,94700.0,Baripara,32700.0,First Owner,4.0,200.0,KTM
83,KTM Duke 250cc,130000.0,Gandhidham,17500.0,Second Owner,4.0,250.0,KTM
...,...,...,...,...,...,...,...,...
9070,KTM RC 200cc,140000.0,Berhampore,2600.0,First Owner,6.0,200.0,KTM
9195,KTM Duke 200cc,70000.0,Thane,49347.0,First Owner,9.0,200.0,KTM
9255,KTM Duke 125cc,135000.0,Bangalore,1050.0,First Owner,3.0,125.0,KTM
9282,KTM Duke 390cc,139100.0,Delhi,25500.0,First Owner,5.0,390.0,KTM
9348,KTM Duke 390cc,195000.0,Mumbai,4568.0,First Owner,4.0,390.0,KTM

GROUPBY OWNER

In [ ]:
group=df.groupby("owner")
group

FINDING OUT THE MIN, MAX, AND MEAN

In [ ]:
group["price"].agg(min_prices="min",max_prices="max",mean_prices="mean")

                      min_prices  max_prices   mean_prices
owner
First Owner               4400.0   1900000.0  85044.934207
Fourth Owner Or More     11000.0    141000.0  62699.000000
Second Owner              7500.0   1550000.0  83653.561224
Third Owner               7000.0    699000.0  83404.130952

FILTERING THE DATA OF BAJAJ

In [ ]:

bajaj=df[df["brand"]=="Bajaj"]

GROUPING THE DATA OF OWNER AND PRINTING THE MIN,MAX AND MEAN

In [ ]:
bajaj_group= bajaj.groupby("owner")
bajaj_group["price"].agg(min_prices="min",max_prices="max",mean_prices="mean")

                      min_prices  max_prices   mean_prices
owner
First Owner               6400.0    195000.0  49915.159664
Fourth Owner Or More     11000.0     37000.0  24000.000000
Second Owner              9000.0    140000.0  41056.980769
Third Owner               7000.0     85000.0  28565.736842

CREATING THE MAP

In [ ]:
# MAPS....
df["owner"].value_counts()

owner
First Owner             6642
Second Owner             588
Third Owner               84
Fourth Owner Or More      10
Name: count, dtype: int64

GIVING THE INDEX NUMBER

In [ ]:
label={"First Owner" :1,"Second Owner":2,"Third Owner":3,"Fourth Owner Or More":4 }
label

{'First Owner': 1,
 'Second Owner': 2,
 'Third Owner': 3,
 'Fourth Owner Or More': 4}

CREATING THE MAP OF OWNER

In [ ]:
df["owner"].map(label)
df

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
...,...,...,...,...,...,...,...,...
9362,Hero Hunk Rear Disc 150cc,25000.0,Delhi,48587.0,First Owner,8.0,150.0,Hero
9369,Bajaj Avenger 220cc,35000.0,Bangalore,60000.0,First Owner,9.0,220.0,Bajaj
9370,Harley-Davidson Street 750 ABS,450000.0,Jodhpur,3430.0,First Owner,4.0,750.0,Harley-Davidson
9371,Bajaj Dominar 400 ABS,139000.0,Hyderabad,21300.0,First Owner,4.0,400.0,Bajaj
9372,Bajaj Avenger Street 220,80000.0,Hyderabad,7127.0,First Owner,5.0,220.0,Bajaj

CREATING THE MAP

In [ ]:
output=df["owner"].map(label)

PRINTING THE OUTPUT

In [ ]:
df["owner"]=output

VALUE_COUNTS

In [ ]:
df["owner"].value_counts()

owner
1    6642
2     588
3      84
4      10
Name: count, dtype: int64